/******************************************************************************/
/*                           叁议电子                                         */
/*                        www.ppptalk.com                                     */
// 版本：      51END
// 文件名：    delay.c
// 说明：      延时函数（STC-ISP自动生成）
// 编写日期：  2017年11月27日
// qq交流群：  677878048
// 网址：      www.ppptalk.com
// 淘宝店地址：https://shop115025335.taobao.com
// 在线视频：  https://space.bilibili.com/253153822/#/channel/detail?cid=37504
// 视频下载:   链接：https://pan.baidu.com/s/1DqXNUDjyAKiApw-aAji8Ug 密码：lezb
// 免责声明：  该程序仅用于学习与交流
// (c) PPPTalk  All Rights Reserved
/******************************************************************************/


/******************************************************************************/
// 包含头文件
/******************************************************************************/
#include "config.h"
#include "delay.h"


/******************************************************************************/
// 函数名称：Delay200ms 
// 输入参数：无
// 输出参数：无 
// 函数功能：延时200ms
// 晶振频率：11.0592M
/******************************************************************************/
//void Delay200ms(void){
//	uint8 i, j, k;
//	_nop_();
//	i = 2;
//	j = 103;
//	k = 147;
//	do
//	{
//		do
//		{
//			while (--k);
//		} while (--j);
//	} while (--i);
//}
